ConfigFiles/Enums/СтатусыВстраиванияФункцийМеханизмов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыВстраиванияФункцийМеханизмов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Встроена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеВстраивается</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеобходимоВстроить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетсяАнализ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Встраивается</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ConfigFiles/Enums/СтатусыВстраиванияФункцийМеханизмов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает соответствие значений перечисления назначенным цветам.
Функция ЦветаСтатусов() Экспорт
	
	Результат = Новый Соответствие;
	
	Результат.Вставить(Перечисления.СтатусыВстраиванияФункцийМеханизмов.Встроена, ЦветаСтиля.ОтметкаПоложительногоВыполненияЗадачи);
	Результат.Вставить(Перечисления.СтатусыВстраиванияФункцийМеханизмов.НеВстраивается, ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
	Результат.Вставить(Перечисления.СтатусыВстраиванияФункцийМеханизмов.НеобходимоВстроить, ЦветаСтиля.ПросроченныеДанныеЦвет);
	Результат.Вставить(Перечисления.СтатусыВстраиванияФункцийМеханизмов.ТребуетсяАнализ, ЦветаСтиля.ПоясняющийОшибкуТекст);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
